{"class_name": "Functional", "config": {"name": "UNET", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_46"}, "name": "input_46", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_418", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_418", "inbound_nodes": [[["input_46", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_396", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_396", "inbound_nodes": [[["conv2d_418", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_396", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_396", "inbound_nodes": [[["dropout_396", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_396", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_396", "inbound_nodes": [[["batch_normalization_396", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_419", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_419", "inbound_nodes": [[["activation_396", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_397", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_397", "inbound_nodes": [[["conv2d_419", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_397", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_397", "inbound_nodes": [[["dropout_397", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_397", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_397", "inbound_nodes": [[["batch_normalization_397", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_88", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_88", "inbound_nodes": [[["activation_397", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_420", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_420", "inbound_nodes": [[["max_pooling2d_88", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_398", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_398", "inbound_nodes": [[["conv2d_420", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_398", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_398", "inbound_nodes": [[["dropout_398", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_398", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_398", "inbound_nodes": [[["batch_normalization_398", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_421", "inbound_nodes": [[["activation_398", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_399", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_399", "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_399", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_399", "inbound_nodes": [[["dropout_399", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_399", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_399", "inbound_nodes": [[["batch_normalization_399", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_89", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_89", "inbound_nodes": [[["activation_399", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_422", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_422", "inbound_nodes": [[["max_pooling2d_89", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_400", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_400", "inbound_nodes": [[["conv2d_422", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_400", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_400", "inbound_nodes": [[["dropout_400", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_400", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_400", "inbound_nodes": [[["batch_normalization_400", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_423", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_423", "inbound_nodes": [[["activation_400", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_401", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_401", "inbound_nodes": [[["conv2d_423", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_401", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_401", "inbound_nodes": [[["dropout_401", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_401", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_401", "inbound_nodes": [[["batch_normalization_401", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_90", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_90", "inbound_nodes": [[["activation_401", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_424", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_424", "inbound_nodes": [[["max_pooling2d_90", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_402", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_402", "inbound_nodes": [[["conv2d_424", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_402", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_402", "inbound_nodes": [[["dropout_402", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_402", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_402", "inbound_nodes": [[["batch_normalization_402", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_425", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_425", "inbound_nodes": [[["activation_402", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_403", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_403", "inbound_nodes": [[["conv2d_425", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_403", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_403", "inbound_nodes": [[["dropout_403", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_403", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_403", "inbound_nodes": [[["batch_normalization_403", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_91", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_91", "inbound_nodes": [[["activation_403", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_426", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_426", "inbound_nodes": [[["max_pooling2d_91", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_404", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_404", "inbound_nodes": [[["conv2d_426", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_404", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_404", "inbound_nodes": [[["dropout_404", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_404", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_404", "inbound_nodes": [[["batch_normalization_404", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_427", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_427", "inbound_nodes": [[["activation_404", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_405", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_405", "inbound_nodes": [[["conv2d_427", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_405", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_405", "inbound_nodes": [[["dropout_405", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_405", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_405", "inbound_nodes": [[["batch_normalization_405", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_88", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_88", "inbound_nodes": [[["activation_405", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_88", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_88", "inbound_nodes": [[["conv2d_transpose_88", 0, 0, {}], ["activation_403", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_428", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_428", "inbound_nodes": [[["concatenate_88", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_406", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_406", "inbound_nodes": [[["conv2d_428", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_406", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_406", "inbound_nodes": [[["dropout_406", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_406", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_406", "inbound_nodes": [[["batch_normalization_406", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_429", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_429", "inbound_nodes": [[["activation_406", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_407", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_407", "inbound_nodes": [[["conv2d_429", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_407", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_407", "inbound_nodes": [[["dropout_407", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_407", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_407", "inbound_nodes": [[["batch_normalization_407", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_89", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_89", "inbound_nodes": [[["activation_407", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_89", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_89", "inbound_nodes": [[["conv2d_transpose_89", 0, 0, {}], ["activation_401", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_430", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_430", "inbound_nodes": [[["concatenate_89", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_408", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_408", "inbound_nodes": [[["conv2d_430", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_408", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_408", "inbound_nodes": [[["dropout_408", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_408", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_408", "inbound_nodes": [[["batch_normalization_408", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_431", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_431", "inbound_nodes": [[["activation_408", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_409", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_409", "inbound_nodes": [[["conv2d_431", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_409", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_409", "inbound_nodes": [[["dropout_409", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_409", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_409", "inbound_nodes": [[["batch_normalization_409", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_90", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_90", "inbound_nodes": [[["activation_409", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_90", "inbound_nodes": [[["conv2d_transpose_90", 0, 0, {}], ["activation_399", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_432", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_432", "inbound_nodes": [[["concatenate_90", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_410", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_410", "inbound_nodes": [[["conv2d_432", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_410", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_410", "inbound_nodes": [[["dropout_410", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_410", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_410", "inbound_nodes": [[["batch_normalization_410", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_433", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_433", "inbound_nodes": [[["activation_410", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_411", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_411", "inbound_nodes": [[["conv2d_433", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_411", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_411", "inbound_nodes": [[["dropout_411", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_411", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_411", "inbound_nodes": [[["batch_normalization_411", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_91", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_91", "inbound_nodes": [[["activation_411", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_91", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_91", "inbound_nodes": [[["conv2d_transpose_91", 0, 0, {}], ["activation_397", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_434", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_434", "inbound_nodes": [[["concatenate_91", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_412", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_412", "inbound_nodes": [[["conv2d_434", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_412", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_412", "inbound_nodes": [[["dropout_412", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_412", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_412", "inbound_nodes": [[["batch_normalization_412", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_435", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_435", "inbound_nodes": [[["activation_412", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_413", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_413", "inbound_nodes": [[["conv2d_435", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_413", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_413", "inbound_nodes": [[["dropout_413", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_413", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_413", "inbound_nodes": [[["batch_normalization_413", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_436", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_436", "inbound_nodes": [[["activation_413", 0, 0, {}]]]}], "input_layers": [["input_46", 0, 0]], "output_layers": [["conv2d_436", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}